# Setting up a MySQL Database

## 1. Introduction
This project seeks to analyze a 22GB relational database first posted as a Kaggle Challenge: [Acquire Valued Shoppers Challenge](https://www.kaggle.com/c/acquire-valued-shoppers-challenge). The code below should be run using a Python kernel as SQL magic has only been developed for IPython.

The competition ended on 14 July 2014. The database focuses on over 300,000 shoppers that redeemed a coupon that they were offered. For each of these shoppers, the database contains the complete *pre-offer* shopping history over at least the past year. Approximately half of these shoppers were offered coupons over March and April 2013 (which they subsequently redeemed) and we have a record of whether they made an additional purchase of the item shown on the coupon.  The other half of shoppers were offered coupons between May and July 2013 (which they also subsequently redeemed) and the goal is to predict which of these shoppers will make an additional purchase of the item on the coupon. Shoppers making additional purchasers of the items on the coupons are considered *Valued Shoppers* and the goal is to find them based on their shopping history and the coupons that they are offered.

<img src="files/shoppers_lores.png">

The code below is a combination of bash and SQL magic. The bash code installs MySQL on an OSx machine as well as IPython connectors to MySQL that are need for the automated setup of the database. No knowledge of bash or SQL is assumed.

## 2. Setting up MySQL

In order to install MySQL, we first install **Homebrew**. **Homebrew** is a package manager that simplifies the installation of software on OSx.

In [ ]:
!ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)‚Äù

If you don't have a package manager installed for Python, one should also install a Python package installer called **pip**. You will be asked for your password in order to perform the installation.

In [ ]:
!sudo easy_install pip

Once Homebrew and pip have been successfully installed, we can install **MySQL**.

In [ ]:
!brew install mysql

With MySQL installed, one wishes to install a connector between IPython and MySQL. The type of connector one installs depends on whether one is running Python 2 or Python 3. **For Python 2, use:**

In [ ]:
!pip install ipython-sql

**For Python 3, rather use:**

In [ ]:
!pip install mysqlclient

We should now be able to use SQL magic within Jupyter! Let's now setup the Acquired Valued Shopper database within MySQL.

## 3. Setting up the Kaggle Database

We are now in a position to setup our database. To start, we load the extension for SQL magic. If MySQL and the Python connector have been correctly installed, the extension should load without issue.

In [2]:
%load_ext sql

To continue further, you need to connect to the MySQL client (hosted locally on your computer). The form of the connection is

```sql
mysql://[username]:[passwd]@localhost
``` 

where the default username is often "root" and the default password is often "root" or "". You will need to change the line initiating the MySQL connection below accordingly.

If you wish to update your password, you may run the following code:

```sql
UPDATE mysql.user SET Password=PASSWORD('Password') WHERE User='root';
```

In [3]:
%%sql
mysql://root:root@localhost
SHOW DATABASES;

5 rows affected.

[('information_schema',),
 ('AcquireShoppers',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

We see that MySQL has a defaut of 2 to 4 databases already setup. These are required by MySQL and shouldn't be deleted. 

We wish to create a new database called "AcquireShoppers" using the csv files available from the Kaggle challenge. **Make sure you create a subdirectory called "Data" containing all the csv files before running these commands.** We load the csv files into tables tied to the Database "AcquireShoppers".

**Note that these commands will take very long to run and so should ideally be run overnight.**

In [15]:
%%sql

DROP DATABASE AcquireShoppers;
CREATE DATABASE AcquireShoppers;
USE AcquireShoppers;
CREATE TABLE offers(offer MEDIUMINT, category SMALLINT, quantity TINYINT, company BIGINT, offervalue FLOAT(3,2), brand MEDIUMINT);
LOAD DATA INFILE "../Data/offers.csv" INTO TABLE offers FIELDS TERMINATED BY "," LINES TERMINATED BY "\n" IGNORE 1 LINES;
CREATE TABLE testHistory(id BIGINT, chain SMALLINT, offer MEDIUMINT, market TINYINT, offerdate DATE);
LOAD DATA INFILE "../testHistory.csv" INTO TABLE testHistory FIELDS TERMINATED BY "," LINES TERMINATED BY "\n" IGNORE 1 LINES;
CREATE TABLE trainHistory(id BIGINT, chain SMALLINT, offer MEDIUMINT, market TINYINT, repeattrips SMALLINT, repeater VARCHAR(1), offerdate DATE);
LOAD DATA INFILE "../Data/trainHistory.csv" INTO TABLE trainHistory FIELDS TERMINATED BY "," LINES TERMINATED BY "\n" IGNORE 1 LINES;
CREATE TABLE transactions(Id BIGINT, chain SMALLINT, dept SMALLINT, category SMALLINT, company BIGINT, brand MEDIUMINT, date DATE, productsize SMALLINT, productmeasure VARCHAR(2), purchasequantity MEDIUMINT, purchaseamount FLOAT(9,2));
LOAD DATA INFILE "../Data/transactions.csv" INTO TABLE transactions FIELDS TERMINATED BY "," LINES TERMINATED BY "\n" IGNORE 1 LINES;

4 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
37 rows affected.
0 rows affected.
151484 rows affected.
0 rows affected.
160057 rows affected.
3 rows affected.
0 rows affected.
349655789 rows affected.

[]

In order to facilitate fast analysis, we wish to index some of the critical fields of the transactions table. This table is by far the largest table, so indexing the right columns will significantly speed up future analysis. The competition states that the *transactions* table can be joined to *trainHistory* and *testHistory* using *(id, chain)*. We thus choose to index these fields. In addition the Kaggle benchmarks use the *brand*, *company* and *category* fields. Hence these fields seem important and we also choose to index them. **The following commands will also take significantly long to run.**

In [19]:
%%sql

CREATE INDEX Idx_trans_Id ON AcquireShoppers.transactions (Id);
CREATE INDEX Idx_trans_chain ON AcquireShoppers.transactions (chain);
CREATE INDEX Idx_trans_category ON AcquireShoppers.transactions (category);
CREATE INDEX Idx_trans_company ON AcquireShoppers.transactions (company);
CREATE INDEX Idx_trans_brand ON AcquireShoppers.transactions (brand);

0 rows affected.
0 rows affected.
0 rows affected.

[]

## 4. Basic Exploration of AcquireShoppers Database

Note that the tables *offers*, *testHistory*, *trainHistory* and *transactions* have 37, 151,484, 160,057 and 349,655,789 rows respectively. Let us see what the four tables we have loaded into the *AcquireShoppers* database look like:

In [32]:
%sql SELECT * FROM offers LIMIT 5;

5 rows affected.

[(1190530, 9115, 1, 108500080, 5.0, 93904),
 (1194044, 9909, 1, 107127979, 1.0, 6732),
 (1197502, 3203, 1, 106414464, 0.75, 13474),
 (1198271, 5558, 1, 107120272, 1.5, 5072),
 (1198272, 5558, 1, 107120272, 1.5, 5072)]

In [33]:
%sql SELECT * FROM testHistory LIMIT 5;

5 rows affected.

[(12262064, 95, 1219903, 39, datetime.date(2013, 6, 27)),
 (12277270, 95, 1221658, 39, datetime.date(2013, 6, 23)),
 (12332190, 95, 1213242, 39, datetime.date(2013, 6, 15)),
 (12524696, 4, 1221665, 1, datetime.date(2013, 6, 20)),
 (13074629, 14, 1221658, 8, datetime.date(2013, 6, 21))]

In [34]:
%sql SELECT * FROM trainHistory LIMIT 5;

5 rows affected.

[(86246, 205, 1208251, 34, 5, 't', datetime.date(2013, 4, 24)),
 (86252, 205, 1197502, 34, 16, 't', datetime.date(2013, 3, 27)),
 (12682470, 18, 1197502, 11, 0, 'f', datetime.date(2013, 3, 28)),
 (12996040, 15, 1197502, 9, 0, 'f', datetime.date(2013, 3, 25)),
 (13089312, 15, 1204821, 9, 0, 'f', datetime.date(2013, 4, 1))]

In [35]:
%sql SELECT * FROM transactions LIMIT 5;

5 rows affected.

[(86246, 205, 7, 707, 1078778070, 12564, datetime.date(2012, 3, 2), 12, 'OZ', 1, 7.59),
 (86246, 205, 63, 6319, 107654575, 17876, datetime.date(2012, 3, 2), 64, 'OZ', 1, 1.59),
 (86246, 205, 97, 9753, 1022027929, 0, datetime.date(2012, 3, 2), 1, 'CT', 1, 5.99),
 (86246, 205, 25, 2509, 107996777, 31373, datetime.date(2012, 3, 2), 16, 'OZ', 1, 1.99),
 (86246, 205, 55, 5555, 107684070, 32094, datetime.date(2012, 3, 2), 16, 'OZ', 2, 10.38)]

Many tables in a relational database often have a primary key (i.e. a field in the table that uniquely identifies each row). The number of distinct entries for the primary key should thus match the number of rows for the table in question. Let's confirm whether our suspicion for what the primary keys for the various tables is true.

A basic schematic of the database is shown. Note, instead of two 'id' fields for *transactions* (as shown in the diagram), there is one 'Id' field for *transactions*.
<img src="files/databases.png">

## 5. Creating a Smaller Database

The 22GB database is daunting to analyse. Code that we run on the database could take very long to run - particularly as we may run out of memory. In the interest of more rapid prototyping, this section creates a smaller database. We randomly select 1% of the shoppers in both the *trainHistory* and the *testHistory* tables. These 1% of shoppers and the corresponding fields shall form two new tables: *trainHistorySmall* and *testHistorySmall*. We also create a new transactions table *transactionsSmall* which contains the transactions of just the 1% of shoppers selected across the training and test sets.

To randomly select columns from *trainHistory* and *testHistory*, we need to add a row number field to each table.

In [49]:
%%sql

ALTER TABLE trainHistory ADD Ind INT NOT NULL AUTO_INCREMENT PRIMARY KEY;
ALTER TABLE testHistory ADD Ind INT NOT NULL AUTO_INCREMENT PRIMARY KEY;

0 rows affected.
0 rows affected.

[]

We create a procedure in SQL that generates a random vector drawn from the row numbers of the *trainHistory* table. The corresponding *id*'s of the sampled row numbers corresponds to the Shopper *id*'s included in the smaller database and are stored in the table *rands*.

In [4]:
%%sql

DROP PROCEDURE IF EXISTS get_rands;
CREATE PROCEDURE get_rands(IN cnt INT)
BEGIN
  DROP TEMPORARY TABLE IF EXISTS rands;
  CREATE TEMPORARY TABLE rands ( rand_id INT );

loop_me: LOOP
    IF cnt < 1 THEN
      LEAVE loop_me;
    END IF;

    INSERT INTO rands
       SELECT Ind FROM trainHistory AS r1 JOIN (SELECT CEIL(RAND() *(SELECT MAX(Ind) FROM trainHistory)) AS rand_id) AS r2 WHERE r1.Ind >= r2.rand_id ORDER BY r1.Ind ASC LIMIT 1;

    SET cnt = cnt - 1;
  END LOOP loop_me;
END;

0 rows affected.
0 rows affected.
0 rows affected.

[]

Below, we specify that 1% of all row entries will be drawn. We show the first 5 row entries picked.

In [5]:
%%sql

CALL get_rands(0.01*(SELECT MAX(Ind) FROM testHistory));
select * from rands limit 5;

1 rows affected.
5 rows affected.

[(87874,), (111783,), (135234,), (20705,), (17939,)]

We can then create a smaller table containing just 1% of *trainHistory*. Let's call this *trainHistorySmall*.

In [7]:
%sql CREATE TABLE trainHistorySmall SELECT s1.Id,chain,offer,market,repeattrips,repeater,offerdate FROM trainHistory AS s1 JOIN (SELECT DISTINCT Id FROM trainHistory AS r1 JOIN (SELECT DISTINCT * FROM rands AS Ind ORDER BY rand_id) AS r2 WHERE r1.Ind=r2.rand_id) AS s2 WHERE s1.Id=s2.Id;

1509 rows affected.

[]

Similarly, let's create a smaller table from the test set called *testHistorySmall*.

In [8]:
%%sql

DROP PROCEDURE IF EXISTS get_rands;
CREATE PROCEDURE get_rands(IN cnt INT)
BEGIN
  DROP TEMPORARY TABLE IF EXISTS rands;
  CREATE TEMPORARY TABLE rands ( rand_id INT );

loop_me: LOOP
    IF cnt < 1 THEN
      LEAVE loop_me;
    END IF;

    INSERT INTO rands
       SELECT Ind FROM testHistory AS r1 JOIN (SELECT CEIL(RAND() *(SELECT MAX(Ind) FROM testHistory)) AS rand_id) AS r2 WHERE r1.Ind >= r2.rand_id ORDER BY r1.Ind ASC LIMIT 1;

    SET cnt = cnt - 1;
  END LOOP loop_me;
END;

CALL get_rands(0.01 *(SELECT MAX(Ind) FROM testHistory));

CREATE TABLE testHistorySmall SELECT s1.Id,chain,offer,market,offerdate FROM testHistory AS s1 JOIN (SELECT DISTINCT Id FROM testHistory AS r1 JOIN (SELECT DISTINCT * FROM rands AS Ind ORDER BY rand_id) AS r2 WHERE r1.Ind=r2.rand_id) AS s2 WHERE s1.Id=s2.Id;

0 rows affected.
0 rows affected.

[]

We may now create a smaller transactions file that is a union of all the transactions originating from the union of the sampled test and training shoppers. Let's call this *transactionsSmall*.

In [9]:
%sql CREATE TABLE transactionsSmall SELECT r1.Id,chain,dept,category,company,brand,date,productsize,productmeasure,purchasequantity,purchaseamount FROM transactions AS r1 INNER JOIN (SELECT Id FROM trainHistorySmall UNION SELECT Id FROM testHistorySmall) AS r2 WHERE r1.Id=r2.Id;

3082796 rows affected.

[]

If you wished to store this smaller set of files as csv's, run the following commands. **Note that you may need to amend the file path below to where you stored the other csvs.**

In [10]:
%%sql

SELECT 'Id','chain','offer','market','repeattrips','repeater','offerdate' UNION ALL SELECT Id,chain,offer,market,repeattrips,repeater,offerdate FROM trainHistorySmall INTO OUTFILE '../Data/trainHistorySmall.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n';
SELECT 'Id','chain','offer','market','offerdate' UNION ALL SELECT Id,chain,offer,market,offerdate FROM testHistorySmall INTO OUTFILE '../Data/testHistorySmall.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n';
SELECT 'Id','chain','dept','category','company','brand','date','productsize','productmeasure','purchasequantity','purchaseamount' UNION ALL SELECT Id,chain,dept,category,company,brand,date,productsize,productmeasure,purchasequantity,purchaseamount FROM transactionsSmall INTO OUTFILE '../Data/transactionsSmall.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n';

1510 rows affected.
1509 rows affected.
3082797 rows affected.

[]

And there we have it! We've successfully installed *MySQL* on our local machines and we've managed to setup an *AcquireShoppers* database with tables loaded from the csv files of the Kaggle competition. As these files are more than 22GB in size, we also chose to create a set of tables with identical structures to their progenitors but with only ~1% of the data. These much smaller tables are far easier to work with as they can easily fit in memory. We thus can use these smaller tables for data exploration and model prototyping